## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_manifest.argocd-gateway will be created
+   resource "kubernetes_manifest" "argocd-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "argocd"
+               namespace = "argocd"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "argocd-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "argocd-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_manifest.cinema-gateway will be created
+   resource "kubernetes_manifest" "cinema-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "cinema"
+               namespace = "cinema"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "wayofthesys-com-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "wayofthesys-com-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key" {
!       id                             = "cert-manager/zerossl-eab-hmac-key" -> (known after apply)
-       immutable                      = false -> null
        # (3 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "zerossl-eab-hmac-key"
!           namespace        = "cert-manager" -> "kube-system" # forces replacement
!           resource_version = "1180987" -> (known after apply)
!           uid              = "aade9fe5-b929-4602-a67f-69da5745467f" -> (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
!       id                             = "cert-manager/zerossl-eab-hmac-key-id" -> (known after apply)
-       immutable                      = false -> null
        # (3 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "zerossl-eab-hmac-key-id"
!           namespace        = "cert-manager" -> "kube-system" # forces replacement
!           resource_version = "1164844" -> (known after apply)
!           uid              = "02fa11e3-f3fa-48dc-8be8-104b2861da0e" -> (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
